app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]
---
     <h3> Comments </h3>
      <% @article.comments.each do |com| %>