app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT "comments".* FROM "comments"
---
  def index
    @articles = Article.all
    @comments = Comment.all

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "05.12 -олеся сдала экзамен"], ["text", "ура ура ура"], ["created_at", "2021-12-05 11:17:22.337773"], ["updated_at", "2021-12-05 11:17:22.337773"]]
---
  def create
    @article = Article.new(article_params)
    if @article.valid?
      @article.save