app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("author", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "SF"], ["body", "body body"], ["article_id", 1], ["created_at", "2021-11-04 10:15:03.169471"], ["updated_at", "2021-11-04 10:15:03.169471"]]
---
  def create
    @article = Article.find(params[:article_id])
    @article.comments.create(comment_params)