app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("email", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "new"], ["message", "hi earth citizens"], ["created_at", "2021-10-26 15:16:47.060942"], ["updated_at", "2021-10-26 15:16:47.060942"]]
---
  def create
    @contact = Contact.new(contact_params)
    if @contact.valid?
      @contact.save